Ran Plan for 2 projects:

1. dir: `cloudfronts` workspace: `default`
1. dir: `cloudfronts` workspace: `myalias1.sandbox.devops.2u.com`

### 1. dir: `cloudfronts` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis/dev/bin/terraform1.6.2 plan -input=false -refresh -out \"/atlantis/dev/repos/cdunda/port-demo/17/default/cloudfronts/default.tfplan\"" in "/atlantis/dev/repos/cdunda/port-demo/17/default/cloudfronts": exit status 1
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 6:
│    6: variable "name" {
│ 
│ The root module input variable "name" is not set, and has no default value.
│ Use a -var or -var-file command line argument to provide a value for this
│ variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 11:
│   11: variable "object_storage_origins" {
│ 
│ The root module input variable "object_storage_origins" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 16:
│   16: variable "hosted_zone" {
│ 
│ The root module input variable "hosted_zone" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 21:
│   21: variable "aliases" {
│ 
│ The root module input variable "aliases" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 26:
│   26: variable "custom_origins" {
│ 
│ The root module input variable "custom_origins" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 31:
│   31: variable "cors_response_headers" {
│ 
│ The root module input variable "cors_response_headers" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 36:
│   36: variable "origin_request_headers" {
│ 
│ The root module input variable "origin_request_headers" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 41:
│   41: variable "cache_policy" {
│ 
│ The root module input variable "cache_policy" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 46:
│   46: variable "ssl_cert" {
│ 
│ The root module input variable "ssl_cert" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 51:
│   51: variable "default_cache_behavior" {
│ 
│ The root module input variable "default_cache_behavior" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 56:
│   56: variable "ordered_cache_behaviors" {
│ 
│ The root module input variable "ordered_cache_behaviors" is not set, and
│ has no default value. Use a -var or -var-file command line argument to
│ provide a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 61:
│   61: variable "cloud_provider" {
│ 
│ The root module input variable "cloud_provider" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵

```
</details>

---
### 2. dir: `cloudfronts` workspace: `myalias1.sandbox.devops.2u.com`
<details><summary>Show Output</summary>

```diff
data.aws_s3_bucket.this["2u-devops-cloudfront-assets"]: Reading...
data.aws_s3_bucket.this["2u-devops-cloudfront-assets"]: Read complete after 0s [id=2u-devops-cloudfront-assets]
data.aws_cloudfront_origin_request_policy.s3: Reading...
data.aws_cloudfront_origin_request_policy.this: Reading...
data.aws_route53_zone.this: Reading...
data.aws_cloudfront_cache_policy.this: Reading...
data.aws_cloudfront_response_headers_policy.this: Reading...
data.aws_cloudfront_response_headers_policy.this: Read complete after 0s [id=e61eb60c-9c35-4d20-a928-2b84e02af89c]
data.aws_cloudfront_origin_request_policy.this: Read complete after 0s [id=216adef6-5c7f-47e4-b989-5492eafa07d3]
data.aws_cloudfront_origin_request_policy.s3: Read complete after 0s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
data.aws_cloudfront_cache_policy.this: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_route53_zone.this: Read complete after 1s [id=ZL2KUECS5PF7E]
module.records["myalias1"].data.aws_route53_zone.this[0]: Reading...
module.records["myalias1"].data.aws_route53_zone.this[0]: Read complete after 0s [id=ZL2KUECS5PF7E]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.cloudfront.aws_cloudfront_distribution.this[0] will be created
+ resource "aws_cloudfront_distribution" "this" {
+       aliases                         = [
+           "myalias1.sandbox.devops.2u.com",
        ]
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "My SRE cdn"
+       continuous_deployment_policy_id = (known after apply)
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2and3"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = true
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_All"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags_all                        = (known after apply)
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = false

+       custom_error_response {
+           error_code         = 403
+           response_code      = 403
+           response_page_path = "/errors/403.html"
        }
+       custom_error_response {
+           error_code         = 404
+           response_code      = 404
+           response_page_path = "/errors/404.html"
        }

+       default_cache_behavior {
+           allowed_methods            = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
+           cached_methods             = [
+               "GET",
+               "HEAD",
            ]
+           compress                   = true
+           default_ttl                = 86400
+           max_ttl                    = 31536000
+           min_ttl                    = 0
+           origin_request_policy_id   = "216adef6-5c7f-47e4-b989-5492eafa07d3"
+           response_headers_policy_id = "e61eb60c-9c35-4d20-a928-2b84e02af89c"
+           smooth_streaming           = false
+           target_origin_id           = "buildkite-node-app"
+           trusted_key_groups         = (known after apply)
+           trusted_signers            = (known after apply)
+           viewer_protocol_policy     = "redirect-to-https"
        }

+       ordered_cache_behavior {
+           allowed_methods            = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
+           cached_methods             = [
+               "GET",
+               "HEAD",
            ]
+           compress                   = true
+           default_ttl                = 86400
+           max_ttl                    = 31536000
+           min_ttl                    = 0
+           origin_request_policy_id   = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
+           path_pattern               = "/static/*"
+           response_headers_policy_id = "e61eb60c-9c35-4d20-a928-2b84e02af89c"
+           smooth_streaming           = false
+           target_origin_id           = "2u-devops-cloudfront-assets"
+           viewer_protocol_policy     = "redirect-to-https"
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = "buildkite-node-app.dev.devops.2u.com"
+           origin_id           = "buildkite-node-app"

+           custom_header {
+               name  = "X-Forwarded-Scheme"
+               value = "https"
            }
+           custom_header {
+               name  = "X-Frame-Options"
+               value = "SAMEORIGIN"
            }

+           custom_origin_config {
+               http_port                = 80
+               https_port               = 443
+               origin_keepalive_timeout = 5
+               origin_protocol_policy   = "match-viewer"
+               origin_read_timeout      = 30
+               origin_ssl_protocols     = [
+                   "TLSv1.2",
                ]
            }
        }
+       origin {
+           connection_attempts      = 3
+           connection_timeout       = 10
+           domain_name              = "2u-devops-cloudfront-assets.s3.us-west-2.amazonaws.com"
+           origin_access_control_id = "E3SF69DXKY5VS5"
+           origin_id                = "2u-devops-cloudfront-assets"
        }

+       restrictions {
+           geo_restriction {
+               locations        = [
+                   "GB",
+                   "NO",
+                   "UA",
+                   "US",
                ]
+               restriction_type = "whitelist"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn      = "arn:aws:acm:us-east-1:516590517042:certificate/a5098ace-915b-49f3-93e1-beaaab0d4ad9"
+           minimum_protocol_version = "TLSv1"
+           ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront.aws_cloudfront_monitoring_subscription.this[0] will be created
+ resource "aws_cloudfront_monitoring_subscription" "this" {
+       distribution_id = (known after apply)
+       id              = (known after apply)

+       monitoring_subscription {
+           realtime_metrics_subscription_config {
+               realtime_metrics_subscription_status = "Enabled"
            }
        }
    }

  # module.records["myalias1"].aws_route53_record.this["myalias1 A"] will be created
+ resource "aws_route53_record" "this" {
+       allow_overwrite = false
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "myalias1.sandbox.devops.2u.com"
+       type            = "A"
+       zone_id         = "ZL2KUECS5PF7E"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d cloudfronts -w myalias1.sandbox.devops.2u.com`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.devops.2u.com:443/lock?id=cdunda%252Fport-demo%252Fcloudfronts%252Fmyalias1.sandbox.devops.2u.com)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d cloudfronts -w myalias1.sandbox.devops.2u.com`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`